app/controllers/users_controller.rb

  def index
    users = User.all

    # ユーザー名絞り込み
    if params[:name].present?
      users = users.get_by_name params[:name]
    end

    # 性別絞り込み
    if params[:gender].present?
      users = users.get_by_gender params[:gender]
    end

    @users = users.page(params[:page]).per(5)
---
SELECT `users`.* FROM `users` WHERE (name like '%{name}%')
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`gender` = '2'

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO `users` (`name`, `gender`, `birthday`, `hometown`, `remarks`, `created_at`, `updated_at`) VALUES ('tes', 0, '2018-07-11', 'test', 'te', '2018-07-11 05:06:32', '2018-07-11 05:06:32')

  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `remarks` = 'te', `updated_at` = '2018-07-11 02:41:34' WHERE `users`.`id` = 1

  def destroy
    @user = User.find(params[:id])
    @user.delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2